#include <stdio.h>

/* 程序30：一个5位数，判断它是不是回文数。
   即12321是回文数，个位与万位相同，十位与千位相同 */

int main(void)
{
    int n;
    int a, b, c, d, e;   /* 万、千、百、十、个 五位 */

    printf("请输入一个5位数: ");
    scanf("%d", &n);

    a = n / 10000;              /* 万位 */
    b = n % 10000 / 1000;       /* 千位 */
    c = n % 1000 / 100;         /* 百位 */
    d = n % 100 / 10;           /* 十位 */
    e = n % 10;                 /* 个位 */

    if (a == e && b == d) {
        printf("%d 是回文数\n", n);
    } else {
        printf("%d 不是回文数\n", n);
    }
    return 0;
}
